{
  "content": "content header",
  "tts": false,
  "embeds": [
    {
      "id": 652627557,
      "title": "Welcome to XP Lotto",
      "description": "a syndicate lottery group dedicated to the success of the XP community.",
      "color": 7334691,
      "footer": {
        "text": "Read all rules & instructions x2 before sending any coins. No refunds for coins sent in wrong amounts.",
        "icon_url": "https://raw.githubusercontent.com/DeathSmack/zamrock/main/discord/embed/xp/xp_logo_0001.webp"
      },
      "author": {
        "name": "1"
      },
      "image": {
        "url": "https://github.com/DeathSmack/zamrock/blob/main/discord/embed/xp/xp_lotto_img.png?raw=true"
      },
      "fields": []
    }
  ],
  "components": [
    {
      "id": 24541514,
      "type": 1,
      "components": [
        {
          "id": 929771945,
          "type": 2,
          "style": 2,
          "label": "Overview",
          "emoji": {
            "id": "1189818350164004895",
            "name": "apeLove",
            "animated": true
          },
          "action_set_id": "848438313"
        },
        {
          "id": 126184161,
          "type": 2,
          "style": 2,
          "label": "Lotto 30k XP",
          "action_set_id": "860137872"
        }
      ]
    }
  ],
  "actions": {
    "848438313": {
      "actions": [
        {
          "type": 1,
          "id": 312832777,
          "text": "XP Lotto\n- XP Lotto consists of two drawing types: regular drawings and guaranteed drawings. \n - Regular drawings take place whenever 30 or more XP Lottery tickets have been sold. \n - Guaranteed drawings take place on the last drawing day of the calendar month if no regular drawings have occurred in that month and tickets have been purchased in that month. \n - In short, guaranteed drawings ensure that there is at least one drawing per month as long as a ticket has been purchased that month. \n- The lottery in which the program participates is determined by the highest jackpot available as all other things like odds and price are the same.\n\nXP Sweepstakes\nSweep consists of two drawings: regular and fauceteers. They operate on the same rules but have different participation costs. Winners are drawn every two weeks (alternating each week).\n\n",
          "public": false
        }
      ]
    },
    "860137872": {
      "actions": [
        {
          "type": 1,
          "id": 845775913,
          "text": "- To participate in the pool, generate a Lotto Address only at \n - https://experiencepoints.io/lotto/.\n- Participants are required to provide an XP Winnings Address for small pool wins and a BTC Winnings Address for large pool wins.\n- There's no limit to deposit amounts.\n- **All deposits are final.**\n- Deposits must be received 1 hour before the drawing to qualify for the drawing.\n- If received late, the deposit will be applied to the next drawing.\n- The same Lotto Address can be used for multiple drawings.\n-If you lose access to your Winnings Addresses, generate a new Lotto Address with different Winnings Addresses.\nShares cost 30,000 XP each. (change effective 4/1/2023)\n- Each participant's cut of the winnings is determined by their number of shares divided by the number of shares for the entire pool.\n- **Partial shares are not recognized and will not be returned.**",
          "public": false
        }
      ]
    }
  },
  "username": "Official XP Lotto",
  "avatar_url": "https://cdn.discordapp.com/emojis/749526193996562432.webp?size=128&quality=lossless"
}
